Repository: brailog/PyAutoTk
Catalog: docs/source/locale/*/LC_MESSAGES/getting_started.po
Languages: pt_br

source: Getting Started
pt_br: Introdução

source: Requirements
pt_br: Requisitos

source: Python 3.6 or higher.
pt_br: Python 3.6 ou superior.

source: Installed compatible browsers (Chrome, Firefox).
pt_br: Navegadores compatíveis instalados (Chrome, Firefox).

source: Supported Platforms:
pt_br: Plataformas Suportadas:

source: **Operating Systems:** Windows 10, Windows 11, Ubuntu 16.04 or newer.
pt_br: **Sistemas Operacionais:** Windows 10, Windows 11, Ubuntu 16.04 ou mais recente.

source: **Browsers:** Firefox and Chrome (Chrome is the default browser).
pt_br: **Navegadores:** Firefox e Chrome (Chrome é o navegador padrão).

source: Installation
pt_br: Instalação

source: Install directly from PyPI::
pt_br: Instale diretamente do PyPI::

source: Or install from the repository::
pt_br: Ou instale a partir do repositório::

source: Example Code
pt_br: Código de Exemplo

source: The example script provided is configured for a browser in Portuguese (pt-BR). To adapt it for English or other languages, ensure the text used in the `aria_label` or other attributes matches the native language of your browser.
pt_br: O script de exemplo fornecido está configurado para um navegador em português (pt-BR). Para adaptá-lo para inglês ou outros idiomas, certifique-se de que o texto usado no `aria_label` ou outros atributos corresponda ao idioma nativo do seu navegador.

source: For instance: - In Portuguese: ``"Próximo Vídeo"`` - In English: ``"Next video"``
pt_br: Por exemplo: - Em português: ``"Próximo Vídeo"`` - Em inglês: ``"Next video"``

source: Update the script accordingly to avoid errors during execution.
pt_br: Atualize o script de acordo para evitar erros durante a execução.
