Repository: brailog/PyAutoTk
Catalog: docs/source/locale/*/LC_MESSAGES/index.po
Languages: pt_br

source: User Guide
pt_br: Guia do Usuário

source: API Reference
pt_br: Referência da API

source: PyAutoTk: A Simplified Automation
pt_br: PyAutoTk: Automação Simplificada

source: PyAutoTk is a Python library designed to streamline web browser automation. Built on Selenium, it provides a modular and extensible interface for automating tasks such as automated testing, web scraping, and rotine automation.
pt_br: PyAutoTk é uma biblioteca Python projetada para simplificar a automação de navegadores web. Construída sobre o Selenium, ela fornece uma interface modular e extensível para automatizar tarefas como testes automatizados, web scraping e automação de rotinas.

source: When to Use?
pt_br: Quando Usar?

source: PyAutoTk is perfect for:
pt_br: PyAutoTk é perfeito para:

source: Developers and QAs creating reusable and scalable scripts.
pt_br: Desenvolvedores e QAs criando scripts reutilizáveis e escaláveis.

source: Professionals automating routine tasks with minimal technical expertise.
pt_br: Profissionais automatizando tarefas rotineiras com conhecimento técnico mínimo.

source: Projects requiring quick integration and straightforward automation scripts.
pt_br: Projetos que exigem integração rápida e scripts de automação simples.

source: Support Information:
pt_br: Informações de Suporte:

source: **Operating Systems:** - Windows 10 and 11 - Ubuntu 16.04 and higher
pt_br: **Sistemas Operacionais:** - Windows 10 e 11 - Ubuntu 16.04 e superiores

source: **Browsers:** - Firefox - Chrome (default)
pt_br: **Navegadores:** - Firefox - Chrome (padrão)
