Repository: brailog/PyAutoTk
Catalog: docs/source/locale/*/LC_MESSAGES/page_obj.po
Languages: pt_br

source: **What is a Page Object?**
pt_br: **O que é um Page Object?**

source: Page Object Model (POM) is a design pattern that promotes separation of concerns. Instead of defining actions directly in scripts, you encapsulate logic in classes that represent pages or UI components.
pt_br: O Page Object Model (POM) é um padrão de design que promove a separação de responsabilidades. Em vez de definir ações diretamente nos scripts, você encapsula a lógica em classes que representam páginas ou componentes da interface do usuário.

source: Practical Example with PyAutoTk
pt_br: Exemplo Prático com PyAutoTk

source: Using the provided local template, let’s automate a contact form:
pt_br: Usando o modelo local fornecido, vamos automatizar um formulário de contato:

source: Using in a Script:
pt_br: Usando em um Script:

source: You can clone the PyAutoTk repository to access a fully functional example page along with pre-structured Page Object implementations. This example is located at the following path:
pt_br: Você pode clonar o repositório do PyAutoTk para acessar uma página de exemplo totalmente funcional juntamente com implementações de Page Object pré-estruturadas. Este exemplo está localizado no seguinte caminho:

source: `PyAutoTk Examples <https://github.com/brailog/PyAutoTk/tree/page-obj/pyautotk/examples>`_
pt_br: `Exemplos do PyAutoTk <https://github.com/brailog/PyAutoTk/tree/page-obj/pyautotk/examples>`_

source: The repository provides:
pt_br: O repositório fornece:

source: A sample webpage for testing automation.
pt_br: Uma página de exemplo para testar automação.

source: A ready-to-use Page Object structure.
pt_br: Uma estrutura de Page Object pronta para uso.

source: Example scripts demonstrating how to interact with the library.
pt_br: Scripts de exemplo demonstrando como interagir com a biblioteca.

source: Cloning the repository is a great way to quickly get started and explore the full potential of PyAutoTk in a practical setting.
pt_br: Clonar o repositório é uma ótima maneira de começar rapidamente e explorar todo o potencial do PyAutoTk em um ambiente prático.
