Repository: brailog/PyAutoTk
Catalog: docs/source/locale/*/LC_MESSAGES/widget.po
Languages: pt_br

source: Widgets represent UI elements on a web page. They simplify basic interactions such as clicking, typing, and scrolling without requiring complex XPath definitions.
pt_br: Widgets representam elementos da interface do usuário em uma página web. Eles simplificam interações básicas, como clicar, digitar e rolar, sem a necessidade de definições complexas de XPath.

source: **Key Widget Actions:**
pt_br: **Ações Principais dos Widgets:**

source: ``click``: Click on an element.
pt_br: ``click``: Clica em um elemento.

source: ``enter_text``: Type text into input fields.
pt_br: ``enter_text``: Digita texto em campos de entrada.

source: ``scroll_to``: Scroll to make an element visible.
pt_br: ``scroll_to``: Rola a página para tornar um elemento visível.

source: ``wait_for``: Wait until an element becomes visible.
pt_br: ``wait_for``: Aguarda até que um elemento se torne visível.

source: ``get_element_properties``: Retrieves the properties of a single element that matches the given XPath, including attributes, text and visibility status.
pt_br: ``get_element_properties``: Recupera as propriedades de um único elemento que corresponda ao XPath fornecido, incluindo atributos, texto e status de visibilidade.

source: ``get_all_elements_properties``: Retrieves the properties of all elements that match the given XPath, including attributes, text, and visibility status.
pt_br: ``get_all_elements_properties``: Recupera as propriedades de todos os elementos que correspondam ao XPath fornecido, incluindo atributos, texto e status de visibilidade.

source: **Basic Example**
pt_br: **Exemplo Básico**

source: Update the script accordingly to your browser language to avoid errors during execution.
pt_br: Atualize o script de acordo com o idioma do seu navegador para evitar erros durante a execução.
